tap "homebrew/services"
brew "bat"
brew "freetype"
brew "fzf"
brew "cairo"
brew "cmake"
brew "dive"
brew "harfbuzz"
brew "ffmpeg"
brew "git"
brew "glfw"
brew "libidn"
brew "llvm"
brew "llvm@17"
brew "openjdk"
brew "maven"
brew "minikube"
brew "mysql"
brew "node"
brew "pipx"
brew "pkgconf"
brew "tmux"
brew "tig"  // git
brew "tokei"
brew "tree"
brew "tree-sitter-cli"
brew "vifm"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "hyper"
cask "docker-desktop"
cask "visual-studio-code"  
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cpptools"
vscode "vscjava.vscode-java-pack"
vscode "vscodevim.vim"
