charliermarsh.ruff
eamodio.gitlens
esbenp.prettier-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
tamasfe.even-better-toml
tomoki1207.pdf
vscjava.vscode-java-pack
vscodevim.vim
